# Pandas Series

In [1]:
import pandas as pd

In [2]:
s1=pd.Series([1,2,3,4,5])
s2=pd.Series(['A','B','C','D','E'])

In [3]:
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
s2

0    A
1    B
2    C
3    D
4    E
dtype: object

In [6]:
#by default axis is 0, two series concat by vertically (row)
pd.concat([s1,s2])

0    1
1    2
2    3
3    4
4    5
0    A
1    B
2    C
3    D
4    E
dtype: object

# Concat Vertically

In [7]:
pd.concat([s1,s2],axis=0)

0    1
1    2
2    3
3    4
4    5
0    A
1    B
2    C
3    D
4    E
dtype: object

# Concat Horizontally

In [8]:
pd.concat([s1,s2],axis=1)

   0  1
0  1  A
1  2  B
2  3  C
3  4  D
4  5  E

# Combine Two Unequal Series (Horizontally and Vertically)

In [9]:
s1=pd.Series([1,2,3,4,5])
s2=pd.Series(['A','B','C','D'])

In [10]:
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [11]:
s2

0    A
1    B
2    C
3    D
dtype: object

In [13]:
pd.concat([s1,s2],axis=1)

   0    1
0  1    A
1  2    B
2  3    C
3  4    D
4  5  NaN

# Combine Two Series Vertically Using Concat() Also Reset the Index

In [14]:
s1=pd.Series([1,2,3,4,5])
s2=pd.Series(['A','B','C','D','E'])

In [15]:
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [16]:
s2

0    A
1    B
2    C
3    D
4    E
dtype: object

In [17]:
pd.concat([s1,s2],axis=0,ignore_index=True)

0    1
1    2
2    3
3    4
4    5
5    A
6    B
7    C
8    D
9    E
dtype: object

# Combine Two DataFrames Horizontally Using Concat()

In [18]:
data1 = {'Name':['Priyang','Aadhya','Vedant','Parshv','krisha'],
         'Marks':[98,99,89,85,87]}
data2 = {'Name':['Priyang','Aadhya','Vedant','Parshv','krisha'],
         'Marks':[98,99,89,85,87]}
df1=pd.DataFrame(data1,index=[0,1,2,3,4])
df2=pd.DataFrame(data2,index=[0,1,2,14,15])

In [20]:
pd.concat([df1,df2],axis=1)

       Name  Marks     Name  Marks
0   Priyang   98.0  Priyang   98.0
1    Aadhya   99.0   Aadhya   99.0
2    Vedant   89.0   Vedant   89.0
3    Parshv   85.0      NaN    NaN
4    krisha   87.0      NaN    NaN
14      NaN    NaN   Parshv   85.0
15      NaN    NaN   krisha   87.0

# Combine Two DataFrames Vertically Using Concat() Also Reset the Index

In [21]:
data1 = {'Name':['Priyang','Aadhya','Vedant','Parshv','krisha'],
         'Marks':[98,99,89,85,87]}
data2 = {'Name':['Priyang','Aadhya','Vedant','Parshv','krisha'],
         'Marks':[98,99,89,85,87]}
df1=pd.DataFrame(data1,index=[0,1,2,3,4])
df2=pd.DataFrame(data2,index=[0,1,2,14,15])

In [24]:
pd.concat([df1,df2],axis=0,ignore_index=True)

      Name  Marks
0  Priyang     98
1   Aadhya     99
2   Vedant     89
3   Parshv     85
4   krisha     87
5  Priyang     98
6   Aadhya     99
7   Vedant     89
8   Parshv     85
9   krisha     87

# Join
- default vlaue of join is outer

In [25]:
data1 = {'Name':['Priyang','Aadhya','Vedant','Parshv','krisha'],
         'Marks':[98,99,89,85,87]}
data2 = {'Name':['Priyang','Aadhya','Vedant','Parshv','krisha'],
         'Marks':[98,99,89,85,87]}
df1=pd.DataFrame(data1,index=[0,1,2,3,4])
df2=pd.DataFrame(data2,index=[0,1,2,14,15])

In [26]:
# inner = intersection, outer =union
pd.concat([df1,df2],axis=1,join='inner')

      Name  Marks     Name  Marks
0  Priyang     98  Priyang     98
1   Aadhya     99   Aadhya     99
2   Vedant     89   Vedant     89

In [27]:
data1 = {'Name':['Priyang','Aadhya','Vedant','Parshv','krisha'],
         'Marks':[98,99,89,85,87]}
data2 = {'Name':['Priyang','Aadhya','Vedant','Parshv','krisha'],
         'Marks':[98,99,89,85,87]}
df1=pd.DataFrame(data1,index=[0,1,2,3,4])
df2=pd.DataFrame(data2,index=[0,1,2,14,15])

In [32]:
pd.concat([df1,df2],axis=0,ignore_index=True)

      Name  Marks
0  Priyang     98
1   Aadhya     99
2   Vedant     89
3   Parshv     85
4   krisha     87
5  Priyang     98
6   Aadhya     99
7   Vedant     89
8   Parshv     85
9   krisha     87

In [33]:
data1 = {'Name':['Priyang','Aadhya','Vedant','Parshv','krisha'],
         'Marks':[98,99,89,85,87]}
data2 = {'Grades':['AB','AA','AB','BA','BB'],
         }
df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)

In [34]:
df1

      Name  Marks
0  Priyang     98
1   Aadhya     99
2   Vedant     89
3   Parshv     85
4   krisha     87

In [35]:
df2

  Grades
0     AB
1     AA
2     AB
3     BA
4     BB

In [38]:
pd.concat([df1,df2],axis=1)

      Name  Marks Grades
0  Priyang     98     AB
1   Aadhya     99     AA
2   Vedant     89     AB
3   Parshv     85     BA
4   krisha     87     BB

# Two or More DataFrames can be concat

In [39]:
data1 = {'Name':['Priyang','Aadhya','Vedant','Parshv','krisha'],
         'Marks':[98,99,89,85,87]}
data2 = {'Name':['Priyang','Aadhya','Vedant','Parshv','krisha'],
         'Marks':[98,99,89,85,87]}
data3 = {'Name':['Priyang','Aadhya','Vedant','Parshv','krisha'],
         'Marks':[98,99,89,85,87]}
df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)
df3=pd.DataFrame(data3)

In [42]:
pd.concat([df1,df2,df3],axis=1)

      Name  Marks     Name  Marks     Name  Marks
0  Priyang     98  Priyang     98  Priyang     98
1   Aadhya     99   Aadhya     99   Aadhya     99
2   Vedant     89   Vedant     89   Vedant     89
3   Parshv     85   Parshv     85   Parshv     85
4   krisha     87   krisha     87   krisha     87

# Concat Pandas DataFrame with Pandas Series

In [43]:
data1 = {'Name':['Priyang','Aadhya','Vedant','Parshv','krisha'],
         'Marks':[98,99,89,85,87]}
df1=pd.DataFrame(data1)

In [44]:
s1=pd.Series(['AB','AA','AB','BA','BB'],name='Grades')

In [45]:
df1

      Name  Marks
0  Priyang     98
1   Aadhya     99
2   Vedant     89
3   Parshv     85
4   krisha     87

In [46]:
s1

0    AB
1    AA
2    AB
3    BA
4    BB
Name: Grades, dtype: object

In [49]:
pd.concat([df1,s1],axis=1)

      Name  Marks Grades
0  Priyang     98     AB
1   Aadhya     99     AA
2   Vedant     89     AB
3   Parshv     85     BA
4   krisha     87     BB

# Parameter => keys

In [50]:
import pandas as pd

In [51]:
data1 = {'Name':['Priyang','Aadhya','Vedant','Parshv','krisha'],
         'Marks':[98,99,89,85,87]}
data2 = {'Name':['Rahul','Anil','Paresh'],
        'Marks':[98,99,89]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [52]:
df1

      Name  Marks
0  Priyang     98
1   Aadhya     99
2   Vedant     89
3   Parshv     85
4   krisha     87

In [53]:
df2

     Name  Marks
0   Rahul     98
1    Anil     99
2  Paresh     89

In [54]:
# ** axis must be 0
pd.concat([df1,df2],axis=0,keys=['DF1','DF2'])

          Name  Marks
DF1 0  Priyang     98
    1   Aadhya     99
    2   Vedant     89
    3   Parshv     85
    4   krisha     87
DF2 0    Rahul     98
    1     Anil     99
    2   Paresh     89

In [55]:
data=pd.concat([df1,df2],axis=0,keys=['DF1','DF2'])
data

          Name  Marks
DF1 0  Priyang     98
    1   Aadhya     99
    2   Vedant     89
    3   Parshv     85
    4   krisha     87
DF2 0    Rahul     98
    1     Anil     99
    2   Paresh     89

In [56]:
data.loc['DF1']

      Name  Marks
0  Priyang     98
1   Aadhya     99
2   Vedant     89
3   Parshv     85
4   krisha     87

In [57]:
data.loc['DF2']

     Name  Marks
0   Rahul     98
1    Anil     99
2  Paresh     89

# Parameter => name

In [58]:
data1 = {'Name':['Priyang','Aadhya','Vedant','Parshv','krisha'],
         'Marks':[98,99,89,85,87]}
data2 = {'Name':['Rahul','Anil','Paresh'],
        'Marks':[98,99,89]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [59]:
df1

      Name  Marks
0  Priyang     98
1   Aadhya     99
2   Vedant     89
3   Parshv     85
4   krisha     87

In [60]:
df2

     Name  Marks
0   Rahul     98
1    Anil     99
2  Paresh     89

In [61]:
pd.concat([df1,df2],keys=['DF1','DF2'], names=['Lavel1','Lavel2'])

                  Name  Marks
Lavel1 Lavel2
DF1    0       Priyang     98
       1        Aadhya     99
       2        Vedant     89
       3        Parshv     85
       4        krisha     87
DF2    0         Rahul     98
       1          Anil     99
       2        Paresh     89

# Parameter => Verify_integrity

In [65]:
data1 = {'Name':['Priyang','Aadhya','Vedant','Parshv','krisha'],
         'Marks':[98,99,89,85,87]}
data2 = {'Name':['Priyang','Aadhya','Vedant','Parshv','krisha'],
         'Marks':[98,99,89,85,87]}
df1 = pd.DataFrame(data1,index=[0,1,2,3,4])
df2 = pd.DataFrame(data2,index=[10,11,12,13,14])

In [69]:
# To avoide duplicate indexes use verify_integrity=True
pd.concat([df1,df2],axis=0, verify_integrity=True)

       Name  Marks
0   Priyang     98
1    Aadhya     99
2    Vedant     89
3    Parshv     85
4    krisha     87
10  Priyang     98
11   Aadhya     99
12   Vedant     89
13   Parshv     85
14   krisha     87

# Parameter => sort

In [76]:
data1 = {'Name':['Priyang','Aadhya','Vedant','Parshv','krisha'],
         'Marks':[98,99,89,85,87]}
data2 = {'Name':['Anil','Rahul','Prakash'],
         'Grades':['AB','AA','AB']}
df1 = pd.DataFrame(data1,index=[2,1,4,5,9])
df2 = pd.DataFrame(data2,index=[10,13,21])

In [77]:
df1

      Name  Marks
2  Priyang     98
1   Aadhya     99
4   Vedant     89
5   Parshv     85
9   krisha     87

In [78]:
df2

       Name Grades
10     Anil     AB
13    Rahul     AA
21  Prakash     AB

In [79]:
pd.concat([df1,df2])

       Name  Marks Grades
2   Priyang   98.0    NaN
1    Aadhya   99.0    NaN
4    Vedant   89.0    NaN
5    Parshv   85.0    NaN
9    krisha   87.0    NaN
10     Anil    NaN     AB
13    Rahul    NaN     AA
21  Prakash    NaN     AB

In [80]:
# if we add column=> axis=1 then sort by row, axis=0(row) then sory by column
pd.concat([df1,df2],axis=1, sort=True)

       Name  Marks     Name Grades
1    Aadhya   99.0      NaN    NaN
2   Priyang   98.0      NaN    NaN
4    Vedant   89.0      NaN    NaN
5    Parshv   85.0      NaN    NaN
9    krisha   87.0      NaN    NaN
10      NaN    NaN     Anil     AB
13      NaN    NaN    Rahul     AA
21      NaN    NaN  Prakash     AB